# Merging for Milestone 2

In [4]:
#Necessary Importations
import pandas as pd
import requests
import io
import os
import seaborn as sns
import matplotlib.pyplot as plt

In [5]:
os.getcwd()

'c:\\Users\\user\\OneDrive\\Documents\\graspp_2025s_fintech\\src'

In [6]:
df_mobile = pd.read_csv("..\data\processed\IMF_mobilemoney.csv")

<>:1: SyntaxWarning: invalid escape sequence '\d'
<>:1: SyntaxWarning: invalid escape sequence '\d'
C:\Users\user\AppData\Local\Temp\ipykernel_16592\2159315550.py:1: SyntaxWarning: invalid escape sequence '\d'
  df_mobile = pd.read_csv("..\data\processed\IMF_mobilemoney.csv")

In [7]:
df_mobile.head()

,Unnamed: 0,COUNTRY,INDICATOR,2016,2017,2018,2019,2020,2021,2022,2023
0,0,Zimbabwe,Value of mobile money transactions (during the...,28.303524,81.761626,63.410127,54.137070,25.053827,20.361375,14.181053,1.494562
1,1,Bulgaria,Value of mobile money transactions (during the...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,2,Cameroon,Value of mobile money transactions (during the...,4.341683,16.448906,29.137805,39.887932,53.409600,NaN,NaN,NaN
3,3,"Latvia, Republic of",Value of mobile money transactions (during the...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,4,"Comoros, Union of the",Value of mobile money transactions (during the...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN